In [217]:
import pandas as pd
stores = pd.read_csv(
    r'C:\Users\koksh\Desktop\pyton\code\web\58-11\3\stores.csv')

In [218]:
stores.describe()

           Store           Size
count  45.000000      45.000000
mean   23.000000  130287.600000
std    13.133926   63825.271991
min     1.000000   34875.000000
25%    12.000000   70713.000000
50%    23.000000  126512.000000
75%    34.000000  202307.000000
max    45.000000  219622.000000

In [219]:
stores.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

In [220]:
stores.dtypes

Store     int64
Type     object
Size      int64
dtype: object

.shape позволяет узнать размерность датасета. Высота X ширина

In [221]:
stores.shape

(45, 3)

In [222]:
stores.size

135

In [223]:
stores.iloc[0:7, 1:3]

  Type    Size
0    A  151315
1    A  202307
2    B   37392
3    A  205863
4    B   34875
5    A  202505
6    B   70713

In [224]:
stores.iloc[[1,5,9,10,36], [0,1,2]]

    Store Type    Size
1       2    A  202307
5       6    A  202505
9      10    B  126512
10     11    A  207499
36     37    C   39910

In [225]:
result = stores[stores['Store'] % 2 == 0]

print(result)

    Store Type    Size
1       2    A  202307
3       4    A  205863
5       6    A  202505
7       8    A  155078
9      10    B  126512
11     12    B  112238
13     14    A  200898
15     16    B   57197
17     18    B  120653
19     20    A  203742
21     22    B  119557
23     24    A  203819
25     26    A  152513
27     28    A  206302
29     30    C   42988
31     32    A  203007
33     34    A  158114
35     36    A   39910
37     38    C   39690
39     40    A  155083
41     42    C   39690
43     44    C   39910

In [226]:
stor = stores.iloc[[3, 7, 10], [0, 1, 2]]
stor

    Store Type    Size
3       4    A  205863
7       8    A  155078
10     11    A  207499

In [227]:
stor.index = ['Vkusno and tochka', 'BK', 'KFC']
stor

                   Store Type    Size
Vkusno and tochka      4    A  205863
BK                     8    A  155078
KFC                   11    A  207499

In [228]:
pd.Series([11,12,13])

0    11
1    12
2    13
dtype: int64

In [229]:
pd.Series([11,12,13], index=['q', 'qq', 'qqq'])

q      11
qq     12
qqq    13
dtype: int64

In [230]:
ser_1 = pd.Series([11,12,13], index=['q', 'qq', 'qqq'])
ser_2 = pd.Series(['la', 'lala', 'lalala'], index=['q', 'qq', 'qqq'])
frame = pd.DataFrame({'naz_st_1':ser_1, 'naz_st_2':ser_2})
frame

     naz_st_1 naz_st_2
q          11       la
qq         12     lala
qqq        13   lalala

In [231]:
stores[['Type']]

   Type
0     A
1     A
2     B
3     A
4     B
5     A
6     B
7     A
8     B
9     B
10    A
11    B
12    A
13    A
14    B
15    B
16    B
17    B
18    A
19    A
20    B
21    B
22    B
23    A
24    B
25    A
26    A
27    A
28    B
29    C
30    A
31    A
32    A
33    A
34    B
35    A
36    C
37    C
38    A
39    A
40    A
41    C
42    C
43    C
44    B